products/admin/fedexwsdl/RateRequest_DE_HAL_Sig_Opt_A_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RateRequest_DE_HAL_Sig_Opt_A</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-15T12:34:56-06:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>PRIORITY_OVERNIGHT</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:Shipper>
               <v13:Contact>
                  <v13:PersonName>WAPI</v13:PersonName>
                  <v13:CompanyName>CSCA-WAPI</v13:CompanyName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Test Address Line1 - Sender</v13:StreetLines>
                  <v13:StreetLines>Test Address Line2 - Sender</v13:StreetLines>
                  <v13:City>COLORADO SPRINGS</v13:City>
                  <v13:StateOrProvinceCode>CO</v13:StateOrProvinceCode>
                  <v13:PostalCode>80915</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Contact>
                  <v13:PersonName>WAPI</v13:PersonName>
                  <v13:CompanyName>SENDER</v13:CompanyName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>WAPI SENDER Avenue</v13:StreetLines>
                  <v13:StreetLines>WAPI SENDER Avenue2</v13:StreetLines>
                  <v13:City>RICHMOND</v13:City>
                  <v13:StateOrProvinceCode>TX</v13:StateOrProvinceCode>
                  <v13:PostalCode>73301</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:SpecialServicesRequested>
               <v13:SpecialServiceTypes>HOLD_AT_LOCATION</v13:SpecialServiceTypes>
               <v13:HoldAtLocationDetail>
                  <v13:PhoneNumber>9072764228</v13:PhoneNumber>
                  <v13:LocationContactAndAddress>
                     <v13:Contact>
                        <v13:PersonName>Recipient Contact</v13:PersonName>
                        <v13:PhoneNumber>1234567890</v13:PhoneNumber>
                     </v13:Contact>
                     <v13:Address>
                        <v13:StreetLines>2210 E Northern Lights Blvd</v13:StreetLines>
                        <v13:City>Anchorage</v13:City>
                        <v13:StateOrProvinceCode>AK</v13:StateOrProvinceCode>
                        <v13:PostalCode>99508</v13:PostalCode>
                        <v13:CountryCode>US</v13:CountryCode>
                     </v13:Address>
                  </v13:LocationContactAndAddress>
                  <v13:LocationType>FEDEX_OFFICE</v13:LocationType>
                  <v13:LocationId>ANCK</v13:LocationId>
                  <v13:LocationNumber>5501</v13:LocationNumber>
               </v13:HoldAtLocationDetail>
            </v13:SpecialServicesRequested>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>5.0</v13:Value>
               </v13:Weight>
               <v13:CustomerReferences>
                  <v13:CustomerReferenceType>CUSTOMER_REFERENCE</v13:CustomerReferenceType>
                  <v13:Value>Ref Information</v13:Value>
               </v13:CustomerReferences>
               <v13:SpecialServicesRequested>
                  <v13:SpecialServiceTypes>SIGNATURE_OPTION</v13:SpecialServiceTypes>
                  <v13:SignatureOptionDetail>
                     <v13:OptionType>ADULT</v13:OptionType>
                  </v13:SignatureOptionDetail>
               </v13:SpecialServicesRequested>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>